Lenti84/VdMot_Controller/software_stm32/src/motor.cpp
  static unsigned int scaler;
  static int valveindex;

  static int waittimer = 0;
  static int psuofftimer = 0;

  if(waittimer) waittimer--;

  switch (valvestate) {
    case A_INIT:  
                  if ( motorcycle(0, CMD_M_NOTHING) == M_RES_IDLE ) {                    
                     COMM_DBG.println("A: init ready");
                     valvestate = A_IDLE;
                     
                     //valveindex = 0;                     
                     //myvalves[valveindex].scaler = 130;
                     //myvalves[valveindex].target_position = 0;    

                     valveindex = 255;
                    
                  }
                  break;

    case A_IDLE:  
                  valveindex = valvenr;
                  if (command == CMD_A_OPEN) {                    
                    COMM_DBG.print("A: cmd open for valve ");                  
                    COMM_DBG.println(valveindex, 10);                    
                    valvestate = A_OPEN1;
                    PSU_ON();
                    waittimer = 50;
                    psuofftimer = 0;
                    pos_change = poschangecmd;
                  }
                  else if (command == CMD_A_CLOSE) {
                    COMM_DBG.print("A: cmd close for valve ");                  
                    COMM_DBG.println(valveindex, 10);                                        
                    valvestate = A_CLOSE1;  
                    PSU_ON();
                    waittimer = 50;
                    psuofftimer = 0;
                    pos_change = poschangecmd;
                  }
                  else if (command == CMD_A_OPEN_END) {                    
                    COMM_DBG.print("A: cmd open to endstop for valve ");                  
                    COMM_DBG.println(valveindex, 10);                    
                    valvestate = A_OPEN1;
                    PSU_ON();
                    waittimer = 50;
                    psuofftimer = 0;
                    pos_change = 255;
                  }
                  else if (command == CMD_A_CLOSE_END) {                    
                    COMM_DBG.print("A: cmd close to endstop for valve ");                  
                    COMM_DBG.println(valveindex, 10);                    
                    valvestate = A_CLOSE1;
                    PSU_ON();
                    waittimer = 50;
                    psuofftimer = 0;
                    pos_change = 255;
                  }
                  else if (command == CMD_A_LEARN) {                    
                    COMM_DBG.print("A: cmd learn for valve ");                  
                    COMM_DBG.println(valveindex, 10);                    
                    valvestate = A_LEARN1;
                    PSU_ON(); 
                    psuofftimer = 0;
                    waittimer = 50; 
                  }
                  else if (command == CMD_A_TEST) {                    
                    COMM_DBG.print("A: cmd test valve ");                  
                    COMM_DBG.println(valveindex, 10);                    
                    valvestate = A_TEST;
                    PSU_ON();
                    waittimer = 100;
                    psuofftimer = 0;
                  }
                  else {
                    valvestate = A_IDLE;

                    // switch off PSU after some inactive (idle) time
                    psuofftimer++;
                    if(psuofftimer > 1500) {      // 15 s
                      psuofftimer = 0;
                      PSU_OFF();
                      MUX_OFF();
                    }  
                  }           

                  // decrement learning counter
                  if(valvestate == A_OPEN1 || valvestate == A_CLOSE1) {
                    if(myvalves[valveindex].learn_movements) myvalves[valveindex].learn_movements--;
                  }

                  // // measure idle current for offset (drift) compensation
                  // if (idlecurrenttimer < 10) 
                  // {
                  //   idlecurrenttimer++;
                  // }
                  // else
                  // {                      
                  //   idlecurrenttimer = 0;
                  //   idlecurrent = (unsigned int) ((uint32_t) (analogRead(ANINREFHALF) * 200 + (uint32_t) idlecurrent_old * 800) / 1000);
                  //   idlecurrent_old = idlecurrent;
                  // }
                 

                  command = '\0';       // clear command for next loop call, prevents reevaluating
                  break;

    case A_OPEN1:  // start valve opening
                  if (!waittimer) {
                    if(pos_change==255) isr_target = 65535;
                    else isr_target = myvalvemots[valveindex].scaler * pos_change;
                    m_meancurrent = myvalvemots[valveindex].meancurrent;
                    
                    if (motorcycle (valveindex, CMD_M_OPEN) == M_RES_OPENS) {
                      COMM_DBG.print("A: begin opening by ");                  
                      COMM_DBG.println(pos_change);
                      myvalvemots[valveindex].status = VLV_STATE_OPENING;                                                            
                      valvestate = A_OPEN2;
                      isr_counter=0;
                    }
                    else {
                      COMM_DBG.print("A: cant open valve");                  
                      valvestate = A_IDLE;
                    }
                  }
                  break;
  
    case A_OPEN2:  // wait for finish opening
                  temp = motorcycle (valveindex, 0);
                  if (temp == M_RES_STOP) {
                    COMM_DBG.println("A: opened valve");                  
                    valvestate = A_IDLE;
                    myvalvemots[valveindex].actual_position += pos_change;
                    myvalvemots[valveindex].status = VLV_STATE_IDLE;                    
                    COMM_DBG.print("A: new position "); COMM_DBG.println(myvalvemots[valveindex].actual_position);
                  }
                  else if (temp == M_RES_NOCURRENT) {
                    COMM_DBG.println("A: undercurrent");
                    myvalvemots[valveindex].status = VLV_STATE_OPENCIR;
                    myvalvemots[valveindex].target_position = myvalvemots[valveindex].actual_position;
                    valvestate = A_IDLE;
                    isr_counter=0;
                  } 
                  else if (temp == M_RES_ENDSTOP) {
                    COMM_DBG.println("A: opened valve to end stop");
                    valvestate = A_IDLE;
                    myvalvemots[valveindex].status = VLV_STATE_IDLE;
                    myvalvemots[valveindex].actual_position = 100;
                    COMM_DBG.print("A: new position "); COMM_DBG.println(myvalvemots[valveindex].actual_position);
                  }                  
                  break;

    case A_CLOSE1:  // start valve closing
                  if (!waittimer) {
                    if(pos_change==255) isr_target = 65535;
                    else isr_target = myvalvemots[valveindex].scaler * pos_change;
                    m_meancurrent = myvalvemots[valveindex].meancurrent;
                    
