Lenti84/VdMot_Controller/software_stm32/src/motor.cpp
                    if (motorcycle (valveindex, CMD_M_CLOSE) == M_RES_CLOSES) {
                      COMM_DBG.print("A: begin closing by ");                  
                      COMM_DBG.println(pos_change);       
                      myvalvemots[valveindex].status = VLV_STATE_CLOSING;                                                     
                      valvestate = A_CLOSE2;
                      isr_counter=0;
                    }   
                    else {
                      COMM_DBG.print("A: cant close valve");                  
                      valvestate = A_IDLE;
                    }
                  }
                  break;

    case A_CLOSE2:  // wait for finish closing
                  temp = motorcycle (valveindex, 0);
                  if (temp == M_RES_STOP) {
                    COMM_DBG.println("A: closed valve");
                    valvestate = A_IDLE;
                    myvalvemots[valveindex].status = VLV_STATE_IDLE;
                    myvalvemots[valveindex].actual_position -= pos_change; 
                    COMM_DBG.print("A: new position "); COMM_DBG.println(myvalvemots[valveindex].actual_position);                   
                  }
                  else if (temp == M_RES_NOCURRENT) {
                    COMM_DBG.println("A: undercurrent");
                    myvalvemots[valveindex].status = VLV_STATE_OPENCIR;
                    myvalvemots[valveindex].target_position = myvalvemots[valveindex].actual_position;
                    valvestate = A_IDLE;
                    isr_counter=0;
                  } 
                  else if (temp == M_RES_ENDSTOP) {
                    COMM_DBG.println("A: closed valve to end stop");
                    valvestate = A_IDLE;
                    myvalvemots[valveindex].status = VLV_STATE_IDLE;
                    myvalvemots[valveindex].actual_position = 0;
                    COMM_DBG.print("A: new position "); COMM_DBG.println(myvalvemots[valveindex].actual_position);
                  }                  
                  break;                  
    
    case A_LEARN1:  // prepare learning          
                  COMM_DBG.println("A: try learning valve");                  
                  // first: closing completely
                  motorcycle (valveindex, CMD_M_CLOSE);
                  myvalvemots[valveindex].status = VLV_STATE_CLOSING;
                  valvestate = A_LEARN2;
                  m_meancurrent = myvalvemots[valveindex].meancurrent;
                  isr_target = 65535;       // max value to disable stopping
                
                  break;

    case A_LEARN2:  // goto start position
                  if (!waittimer) {
                    // waiting for closed valve as start position
                    temp = motorcycle (valveindex, 0);
                    if (temp == M_RES_ENDSTOP) {
                      COMM_DBG.println("A: closed valve before learning, now opening");                  
                      // second: opening completely and count rotations
                      isr_counter=0;
                      myvalvemots[valveindex].status = VLV_STATE_OPENING;
                      motorcycle (valveindex, CMD_M_OPEN);
                      isr_target = 65535;       // max value to disable stopping
                      valvestate = A_LEARN3;
                      m_meancurrent = myvalvemots[valveindex].meancurrent;
                      waittimer = 10;
                    }
                    else if (temp == M_RES_NOCURRENT) {
                      COMM_DBG.println("A: undercurrent");
                      myvalvemots[valveindex].status = VLV_STATE_OPENCIR;
                      myvalvemots[valveindex].target_position = myvalvemots[valveindex].actual_position;
                      valvestate = A_IDLE;
                      isr_counter=0;
                    }
                  }               
                  break;
                  
    case A_LEARN3:  // learning opening way
                  if (!waittimer) {
                    // waiting for opened valve
                    temp = motorcycle (valveindex, 0);
                    if (temp == M_RES_ENDSTOP) {
                      COMM_DBG.println("A: opened valve for learning, now closing again");                  
                      opening_count = isr_counter;   
                      if(m_meancurrent > 0) {
                        myvalvemots[valveindex].meancurrent = m_meancurrent;
                        COMM_DBG.print("A: learned mean current = "); COMM_DBG.println(myvalvemots[valveindex].meancurrent);
                      }                 
                      // third: closing completely and count rotations
                      isr_counter=0;
                      myvalvemots[valveindex].status = VLV_STATE_CLOSING;
                      motorcycle (valveindex, CMD_M_CLOSE);
                      isr_target = 65535;       // max value to disable stopping
                      m_meancurrent = 20;
                      valvestate = A_LEARN4;
                      waittimer = 10;
                    }          
                    else if (temp == M_RES_NOCURRENT) {
                      COMM_DBG.println("A: undercurrent");
                      myvalvemots[valveindex].status = VLV_STATE_OPENCIR;
                      myvalvemots[valveindex].target_position = myvalvemots[valveindex].actual_position;
                      valvestate = A_IDLE;
                      isr_counter=0;
                    }        
                  }              
                  break;
                  
    case A_LEARN4:  // learning closing way
                  if (!waittimer) {
                    // waiting for closed valve again
                    temp = motorcycle (valveindex, 0);
                    if (temp == M_RES_ENDSTOP) {  
                      COMM_DBG.println("A: closed valve for learning");                  
                      closing_count = isr_counter;  

                      if(m_meancurrent > 0) {
                        COMM_DBG.print("A: learned mean current = "); COMM_DBG.println(m_meancurrent);
                        myvalvemots[valveindex].meancurrent = (myvalvemots[valveindex].meancurrent + m_meancurrent) / 2;                      
                      }                      
                                          
