Lenti84/VdMot_Controller/software_stm32/src/motor.cpp
      case M_CLOSE:
                    COMM_DBG.println("M: state close");                                 
                    set_motor(mvalvenr, DIR_CLOSE);
                    //digitalWrite(POWER_ENA, 0);   // enable PSU for vlaves
                    delay(50);    // wait for relay
                    //ena_motor(mvalvenr, 1);
                      
                    motorstate = M_TURNON;
                    isr_valvenr = mvalvenr;
                    isr_counter=0;
                    cyclecnt = 0;
                    debouncecnt = 0;
                    result = M_RES_CLOSES;
                    attachInterrupt(digitalPinToInterrupt(REVINPIN), isr_count, RISING);
  
                    break;
                  
      case M_TURNON:
                    isr_turning = 1;
                    result = M_RES_TURNING;
                    isr_timer_go = 1;

                    currentbound_low = (int) (m_meancurrent * -1 * currentbound_low_fac); //10 * -3;
                    currentbound_high = (int) (m_meancurrent * currentbound_high_fac); //10 * 3;

                    meancurrent_mem = 0;
                    meancurrent_cnt = 0;

                    // check if pwm is finished
                    if(isr_timer_fin) {
                      motorstate = M_TURNING;
                      isr_timer_fin = 0;
                      isr_timer_go = 0;
                    }

                    break;

      case M_TURNING:
                    isr_turning = 1;
                    result = M_RES_TURNING;
    
                    if (cmd == CMD_M_STOP) {
                      motorstate = M_STOP;  
                    }
                    cyclecnt++;
                                
                    if(debouncecnt<255) debouncecnt++;
                    if(testcnt<255) testcnt++;

                    if (debouncecnt > 7) {

                      // calc current in 1/10 mA
                      analog_current = (int) ((( (int32_t) analogRead(ANINCURRENT) - (int32_t) analogRead(ANINREFHALF)) * ANINCURRENTGAIN) / 100);
                      // COMM_DBG.print(analog_current,DEC);
                      // COMM_DBG.print(" ");
                      // COMM_DBG.print(idlecurrent,DEC);
                      // COMM_DBG.println(" analog_current");

                      // filter
                      analog_current = (int) (((int32_t) analog_current_old * 800 + (int32_t) analog_current * 200) / 1000);
                      analog_current_old = analog_current;

                      current_mA = analog_current;

                      // if (testcnt > 40) {
                      //   testcnt = 0;
                      //   COMM_DBG.print("A0 current ");
                      //   COMM_DBG.print(analog_current,DEC);
                      //   COMM_DBG.print(" idle ");
                      //   COMM_DBG.print(idlecurrent,DEC);
                      //   COMM_DBG.println(" digits");
                      // }

                      // under current detection
                      if(current_mA < THRESHOLD_UNDERCURRENT && current_mA > -THRESHOLD_UNDERCURRENT) 
                      {
                        undercurrcnt++;
                        if (undercurrcnt > TIMEOUT_UNDERCURRENT)
                        {
                          undercurrcnt = 0;
                          motorstate = M_UNDERCURR;
                        }                        
                      }

                      // overcurrent detection
                      if(current_mA > currentbound_high || current_mA < currentbound_low ||  
                         current_mA > 1000 || current_mA < -1000)         // safety mechanism, limit at +- 100 mA
                      {
                        overcurrcnt++;
                        if (overcurrcnt > TIMEOUT_OVERCURRENT)
                        {
                          //motorstate = M_STOP;                          
                          detachInterrupt(digitalPinToInterrupt(REVINPIN)); 
                          overcurrcnt = 0;
                          motorstate = M_IDLE;
                          result = M_RES_ENDSTOP;
                          ena_motor(0, 0);
                          isr_turning = 0;
                          //MUX_OFF();

                          if (meancurrent_cnt > 0) m_meancurrent = abs(meancurrent_mem) / meancurrent_cnt / 10;
                          else m_meancurrent = 0;
                      
                          COMM_DBG.print("M: Current: "); COMM_DBG.print(current_mA/10,10); COMM_DBG.println(" mA");
                          //#warning fixme
                          //COMM_DBG.print("M: Current: "); COMM_DBG.print(current_mA,10); COMM_DBG.println(" 1/10 mA");
                          COMM_DBG.print("M: Cnt:     "); COMM_DBG.println(isr_counter, DEC);                                 
                          COMM_DBG.println("M: Autostop, reached end stop");
                        }
                      }
                      else 
                      {
                        //COMM_DBG.print("M: Current: "); COMM_DBG.print(current_mA/10, 10); COMM_DBG.println(" mA");
                      }
                      //cyclecnt=0;

                      // testmode
                      // output position and current
                      if(testmode) {
                        COMM_DBG.print("tm;"); COMM_DBG.print(current_mA,10); COMM_DBG.print(";"); COMM_DBG.println(isr_counter);

                      }
                    }

                    if (debouncecnt > 50 && cyclecnt > 50) {
                      cyclecnt=0;
                      COMM_DBG.print("M: Current: "); COMM_DBG.print(current_mA/10, 10); COMM_DBG.println(" mA");
                      //#warning fixme
                      //COMM_DBG.print("M: Current: "); COMM_DBG.print(current_mA, 10); COMM_DBG.println(" 1/10 mA");
                      meancurrent_mem += current_mA;
                      meancurrent_cnt++;
                    }
                    break;
                      
      case M_STOP:         
                    //detachInterrupt(digitalPinToInterrupt(REVINPIN));
                    COMM_DBG.println("M: state stop");    
                                                      
                    ena_motor(0, 0);
                    //digitalWrite(POWER_ENA, 1);   // disable PSU for vlaves   
                    isr_turning = 0;
                    //MUX_OFF();
                    
                    COMM_DBG.print("M: Cnt: ");  
                    COMM_DBG.println(isr_counter, DEC);                                 
  
                    motorstate = M_IDLE;
                    result = M_RES_STOP;                  
                    
                    break;

      case M_STOP_ISR: 
                    COMM_DBG.println("M: target stop");  
                    motorstate = M_STOP;
                    result = M_RES_STOP_ISR;  
                    break;

      case M_UNDERCURR:         
                    detachInterrupt(digitalPinToInterrupt(REVINPIN));
                    COMM_DBG.println("M: state undercurrent detected, stopped");    
                                                      
                    ena_motor(0, 0);
                    //digitalWrite(POWER_ENA, 1);   // disable PSU for vlaves 
                    isr_turning = 0;
                    //MUX_OFF();
                    
                    motorstate = M_IDLE;
                    result = M_RES_NOCURRENT;                  
                    
                    break;

      case M_TESTPREP:
                    COMM_DBG.println("M: test prep");                                  
                    set_motor(mvalvenr, DIR_OPEN); 
                    ena_motor(mvalvenr, 1);                 
                
                    cyclecnt = 0;
                    undercurrcnt = 0;
                    debouncecnt = 0;

