Lenti84/VdMot_Controller/software_stm32/src/motor.cpp
                    analog_current_old = 0;
                    analog_current = 0;

                    motorstate = M_TEST;
                    result = M_RES_TEST;                    

                    break;

      case M_TEST:
                    COMM_DBG.print("M: testing"); 

                    result = M_RES_TEST;
    
                    // calc current in 1/10 mA
                    analog_current = (int) ((( (int32_t) analogRead(ANINCURRENT) - (int32_t) analogRead(ANINREFHALF)) * ANINCURRENTGAIN) / 100);

                    analog_current = (int) (((int32_t) analog_current_old * 500 + (int32_t) analog_current * 500) / 1000);
                    analog_current_old = analog_current;

                    current_mA = analog_current;
                    
                    COMM_DBG.print(" - current: ");
                    COMM_DBG.println (analog_current,DEC);

                    if(debouncecnt<255) debouncecnt++;

                    if(debouncecnt>7) {

                      // under current detection
                      if(current_mA < THRESHOLD_UNDERCURRENT && current_mA > -THRESHOLD_UNDERCURRENT) 
                      {
                        // undercurrcnt++;
                        // if (undercurrcnt > TIMEOUT_UNDERCURRENT)
                        // {
                          COMM_DBG.println("test: undercurrent!");
                          undercurrcnt = 0;
                          motorstate = M_IDLE;
                          result = M_RES_NOCURRENT;
                          ena_motor(0, 0);
                        //}                        
                      }

                      // overcurrent detection
                      else if(current_mA > currentbound_high || current_mA < currentbound_low ||  
                        current_mA > 1000 || current_mA < -1000)         // safety mechanism, limit at +- 100 mA
                      {
                        // overcurrcnt++;
                        // if (overcurrcnt > TIMEOUT_OVERCURRENT)
                        // {
                          COMM_DBG.println("test: overcurrent!");
                          overcurrcnt = 0;
                          motorstate = M_IDLE;
                          result = M_RES_ENDSTOP;
                          ena_motor(0, 0);
                        
                        //}
                      }

                      // normal turning
                      else  {          
                         COMM_DBG.println("test: normal turning!");            
                         motorstate = M_IDLE;
                         result = M_RES_OPENS;
                         ena_motor(0, 0);                      
                      }
                    }

                    break;
                    
      default:      motorstate = M_IDLE;
                    result = M_RES_IDLE;
                    break;
    }  

  //}
  return result;
}


// sets direction and mux relay
void set_motor (int smvalvenr, int dir) {

  if (smvalvenr % 2) { MUX_OFF(); }
  else { MUX_ON(); }
  
  if (dir == DIR_OPEN) { DIR_OFF(); } 
  else { DIR_ON(); }
}


// enables motor 
void ena_motor (int emvalvenr, int state) {

  if (state == 0) { 
    ENA0_OFF(); ENA1_OFF(); ENA2_OFF(); ENA3_OFF(); ENA4_OFF(); ENA5_OFF(); 
  }
  else {
    if (emvalvenr == 0 || emvalvenr == 1) { ENA0_ON(); }
    else if (emvalvenr == 2 || emvalvenr == 3) { ENA1_ON(); }
    else if (emvalvenr == 4 || emvalvenr == 5) { ENA2_ON(); }
    else if (emvalvenr == 6 || emvalvenr == 7) { ENA3_ON(); }
    else if (emvalvenr == 8 || emvalvenr == 9) { ENA4_ON(); }
    else if (emvalvenr == 10 || emvalvenr == 11) { ENA5_ON(); }
  }
}


void isr_count () {
  if (isr_turning) isr_counter++;
  if (isr_target > 0) isr_target--;
  else callback_motorstop();
}


// call from isr to stop motor immediately
void callback_motorstop () {
  detachInterrupt(digitalPinToInterrupt(REVINPIN));
  isr_turning = 0;
  ena_motor(0, 0);  
  motorcycle(0, CMD_M_STOP_ISR);  
}


// returns state of application  state machine
enum ASTATE valve_getstate () {
  return valvestate;
}


int16_t appsetaction(char cmd, unsigned int valveindex, byte posdelta) {

  if(valvestate == A_IDLE) {
    valvenr = (int) valveindex;
    command = cmd;
    poschangecmd = posdelta;
    return 0;
  }
  else return -1;

}


void TimerHandler0()
{
  static unsigned int rampcnt = 0;      // makes duty cycle of pwm
  static unsigned int cnt = 0;          // makes periode time of pwm

  if(isr_timer_go && !isr_timer_fin) {
    
    if(cnt<=rampcnt) {        
      //ENA0_ON();
      ena_motor(isr_valvenr, 1);
    }
    else {
      //ENA0_OFF();
      ena_motor(isr_valvenr, 0);
    }

    // do counters
    if(cnt<16) cnt++;
    else {
      cnt = 0;  
      
      if(rampcnt<16) rampcnt++;
      else {    // finish & reset
        isr_timer_fin = 1;
        cnt = 0;
        rampcnt = 0;
      }
    }
  }
}